{
  "sections": [
    {
      "id": "intro",
      "title": "OSPO in Academia",
      "level": 1,
      "content": [
        {
          "type": "markdown",
          "data": "# Open-Source Programming Offices (OSPOs) in Academia\n\nMuch has been written on the technical side of making scientific free/open-source software (F/OSS); performant code, important licensing, building reproducible data pipeline, and so on. \n\nBut academic F/OSS is more than that; it is about the banality of evil of integrating F/OSS to research projects. How projects can get out of hand. How taking the time of building reproducible pipeline might get in the way of publishing papers. Dealing with institutional inertia, even though everybody might be on board with open source.\n\nWe identify key challenges:\n- How can we best spread best coding practices, given the above considerations\n- What should we adapt from industry, but perhaps more importantly, what not to bring from industry\n- Building sustainable practices in an academic environment\n- ..."
        }
      ],
      "references": [
        {
          "id": "1",
          "citation": "The Turing Way Community. (2022). The Turing Way: A handbook for reproducible, ethical and collaborative research (1.0.2). Zenodo. DOI The Turing Way Community (2025)."
        },
        {
          "id": "2",
          "citation": "OpenSciency Contributors (2023, February 22). Opensciency - A core open science curriculum by and for the research community. Zenodo. DOI 10.5281/zenodo.7392118"
        },
        {
          "id": "3",
          "citation": "Scopatz, A., Huff, K. D. (2015). Effective Computation in Physics: Field Guide to Research with Python. Japan: O'Reilly Media."
        }
      ]
    },
    {
      "id": "work-with-me",
      "title": "Working with a research software engineer",
      "level": 1,
      "content": [
        {
          "type": "markdown",
          "data": "## Working with me"
        },
        {
          "type": "markdown",
          "data": "My role as a research software engineer (RSE) is best described as multifaceted.\n\nRSEs typically work in open-source programming offices (OSPOs), promoting best programming practices to advance research ([this link](https://us-rse.org/about/what-is-an-rse/), the [uk version](https://society-rse.org/about/)). This includes writing computer programs that are reproducible, scalable, and generally do what you think they do. That is, how do you do more with less such that it can be reproduced, and if necessary further modified, in the long run. Anybody who ever wrote code knows it is harder than it seems.\n\nRSEs promote various aspects of free and open-source software (F/OSS) such as adopting the right license for your project, using tools designed for collaboration, or improving project design (good filenaming, outreach, etc). Creating an OSPO has been shown to facilitate the internalization of programming practices and values in myriad ways.\n\nAs a _research_ software engineer, I emphasize how best programming practices improve scientific work. For instance, by meeting challenges like:\n\n- _Data collection_: Maybe you want different people to send data your way? Building a front-end interface connected to a database is a great way to build datasets.\n- _Data labeling_: Labeling data is key to assess model performance. How can you have groups labeling data effectively? This is trickier than it first appears, as optimizing information content of data labels is challenging.\n- _Model-specific pipelines_: Working with Bayesian statistics is different than working with sklearn models. Understanding how methods relate to data helps me find ways open-source practices can help research groups save time.\n\nAs an RSE coming from academia, I have unique modeling expertise in natural language processing, open-source Large Language Models, Bayesian statistics, network analysis, and more. This helps me understand the needs of specific research groups.\n\nThe RSE job can be as straightforward as delivering shiny deliverables—interactive maps or web applications with bells and whistles—designed to please stakeholders and funding agencies. These tools help research reach audiences beyond academia. Given my experience, I build these deliverables more professionally and in less time than most students or interns can (though some students these days can be pretty darned good at coding)."
        },
        {
          "type": "markdown",
          "data": "#### But what is collaboration?\n\nBut what excites me most about my role is the ability to **foster collaboration within and across diverse teams to support fun, impactful, and data-driven research**. To me, the real challenge isn't just technical—it's getting people to see how open-source practices can address science's Achilles' heel: collaboration.\n\nI say that half-jokingly. Of course, science is 'collaborative'—we cite each other, build communities around shared ideas, and contribute to what we see as the greater good. But for computational work, researchers still mostly write code for themselves. Why?\n\nOne reason is that researchers used to be hackers who simply made their code work. Sometimes, that's all you need. But this approach is individualistic—only you can work on that code, and even future-you might be unhappy about it. Code was, as it should be, secondary to the research.\n\nAnother reason is that academia incentivizes individualistic behaviors. Achievements are measured personally—citation metrics, awards, grants—not how well you write code for others. We attribute discoveries to specific individuals (even though that's often misleading), and we admire those who publish prolifically and secure major funding. We cite each other, but citations are often strategic. This isn't all bad—developing strong individual capabilities is worth striving for. Still, research shows that groups of strong collaborators consistently produce more creative work than collections of highly capable but uncooperative individuals."
        },
        {
          "type": "markdown",
          "data": "#### Building Bridges\n\nIntegrating F/OSS into research—not just the software, but the underlying values—can help address this tension between individuals and groups. From the beginning, F/OSS has reconciled strong individual egos with effective teamwork. In this light, my view of the RSE role isn't just about programming languages and libraries. It's about building bridges between academia's individualistic incentives and the shared values of the open-source movement.\n\nThis is a nontrivial task. How do we help newcomers—researchers who've only recently started using F/OSS—understand what open-source ethos can bring to their work? When bringing me on board, I instill the idea that improving one's ability to integrate F/OSS directly connects to enjoying it. Consider when you hit a frustrating code bug. F/OSS natives might seek help in forums, but they also enjoy discovering _why_ the bug exists. If code is merely an obstacle, you'll miss the insights gained from investigating the systems powering modern science.\n\nWhat intrigues me as an RSE is how open-source software can be tailored to specific team compositions. How do we reconcile the collaborative nature of open-source work with scientific endeavors that often incentivize individual achievements? This tension is central to the RSE role: how can we make science more collaborative within institutional frameworks that prioritize personal advancement?"
        },
        {
          "type": "markdown",
          "data": "#### A Humanist Perspective\n\nAs a humanities scholar, I believe that computational representations are not neutral. Computers excel with bits, but we struggle to truly represent more nuanced concepts like the meaning of a story, or emotions. We have only simplified models that may or may not depict reality (mostly not, but hey, maybe we are getting there). I describe myself as a 'humanist-inclined RSE', a term I just made up to highlight that our computational tools for studying human and living systems are still evolving."
        },
        {
          "type": "markdown",
          "data": "#### Setting Expectations\n\nThe RSE position itself testifies to ongoing changes. As an RSE, I help others adopt tools and technologies that transform collaborative work. The precise definition remains fluid—and purposefully so. However, there are clear boundaries:\n\n- **The RSE is not a PhD student**: I typically don't lead research question development, but instead facilitate others' research design. While not developing research questions full-time, I remain a part-time researcher capable of critically analyzing research potential.\n- **The RSE's role should be agreed upon in proposals**: To avoid frustration, my degree of involvement should be clear from the start. This doesn't remove flexibility—my expertise can be applied through mentorship, technical help, or methodological guidance. If needs change, we can adjust.\n- **Case studies provide guidance**: As RSE is an emerging role, it can be hard to envision exactly what I do. Consulting example projects helps understand what's easier or harder, how projects can go sideways, etc.\n- **Sustainability Planning**: How can we ensure that the software delivered can be maintained after the RSE direct involvement ends, e.g. through documentation, knowledge transfer, or training.\n\nWorking with me means navigating a fluid boundary—I'm a research collaborator committed to delivering project outcomes for stakeholders while bringing open-source values that make research more collaborative, reproducible, and impactful."
        }
      ]
    },
    {
      "id": "estimating",
      "title": "Estimating Project Difficulty",
      "level": 1,
      "content": [
        {
          "type": "markdown",
          "data": "# Case studies in Estimating Project Difficulty\n\nWhen estimating project difficulty, consider the following factors:\n\n- **Complexity**: Some projects are 'objectively' more complex than others. A project with one or few components have less dependencies and less code associated with ith. But...\n- **Team complementarity**: Complexity depends on the different sets of expertise on a team. The same component can be written such that it is simpler for more experienced individuals\n- **Iteration loops**: Some aspect of the projects cannot be known in advance. This is sometimes inevitable."
        }
      ]
    },
    {
      "id": "easy",
      "title": "Easy Projects",
      "level": 2,
      "parentId": "estimating",
      "content": [
        {
          "type": "markdown",
          "data": "## Easy\n\nEasy is perhaps a slightly misleading label. You only really know how easy a project is once you have done it."
        }
      ]
    },
    {
      "id": "vermontticks",
      "title": "Vermont Ticks",
      "level": 3,
      "parentId": "easy",
      "content": [
        {
          "type": "markdown",
          "data": "### Vermont Ticks\n\nThe Vermont Ticks project aims to track the spread of infectious diseases in Vermont, using sophisticated mechanistic and statistical models. The client is the MAP2LE team.\n\nThe MAP2LE team reached out to the RSE to help design an interactive map where it would be possible to look at probability of infections, given different states (the vector disease, weather, time of the year, etc). The RSE provided a draft of the interactive map that could be achieved, which was put in the draft sent for grant. This draft map was done in less than an hour."
        },
        {
          "type": "image",
          "data": {
            "src": "images/MAP2LE_vermonticks.png",
            "alt": "Diagram showing the academic open-source workflow",
            "caption": "Figure 1: Draft of the deliverable.",
            "width": 500
          }
        },
        {
          "type": "markdown",
          "data": "The plan does not involve mentorship on the behalf of the RSE. Once the project has been funded, the RSE will collaborate with experienced researchers to develop that interactive map.\n\nAs a product, this map is estimated to be fairly easy to do, given what has been agreed in the research proposal (the current effort bet is around 5-10 RSE-hours for a working prototype, but can involve more effort if the map ought to be more polished).\n\nThe product seems easy enough to do because it is a single-web app page, including a map of Vermont with a few widgets (activity, vector type, model type). That said, the RSE identified two aspects of the project that could be more time consuming to implement, based on his experience. \n- Making sure the Application Programming Interface has access to hourly/daily weather data.\n- The API data should be then used in models developed by the team. The back and forth depending on the particular models used, and predictive performance in this case, could require some more efforts to fine-tune."
        },
        {
          "type": "callout",
          "data": {
            "type": "hint",
            "icon": "ℹ️",
            "title": "Note",
            "content": "Since the RSE is not expected to provide modeling expertise in this project, it makes the overall project easier."
          }
        },
        {
          "type": "markdown",
          "data": "Once the app has been deployed, the RSE doesn't take responsibility of developing it further. That is, if the MAP2LE team wants to develop further extensions to the basic web app, they might need to re-apply. The RSE still commits himself to fix bugs due to flawed original design, if within the boundary of the prior agreement. The RSE is expected to write documentation in accordance with open-source principles such that the project could be developed further later on without too much hassle, if needs be."
        },
        {
          "type": "callout",
          "data": {
            "type": "hint",
            "icon": "ℹ️",
            "title": "Note",
            "content": "A student could helped on the project design and take care of the maintenance."
          }
        },
        {
          "type": "callout",
          "data": {
            "type": "warning",
            "icon": "⚠️",
            "title": "Warning",
            "content": "A key challenge academics are facing when doing computational works is that they rarely know in advance what is going to be the scope of the work. This can lead to the project going sideways in a different ways.\n\nThe scope might be 'clear', in the sense that stakeholders know in a vague way what they want, but the expectations are not realists. That is, the 'true' level of expertise or work required to accomplish the projects' goals are beyond current level of expertise. This can be a good learning opportunity for students, an important source of frustation, or both.\n\nConsider a case where the MAP2LE team didn't realize, but the data is ungainly and large. As such, the data pipeline would benefit from building a Postgres database that the web interface could query. Furthermore, it wasn't clear before, but the model the MAP2LE team had in mind won't work, or perhaps the inference they want to make are not doable, given the data they currently have. A student could take on herself to fix both problems, leading to unreasonable level of expectations, while stakeholders don't see the effort required in fixing both problems. Setting up a database is a nontrivial task to do when it is a first time, especially when students are not coming from a computer science background."
          }
        }
      ]
    },
    {
      "id": "vermontlivability",
      "title": "Vermont-Livability-Map",
      "level": 3,
      "parentId": "easy",
      "content": [
        {
          "type": "markdown",
          "data": "### Vermont Livability Map\n\nThe Vermont Livability Project capitlized on previous work to deliver a short scrollytelling adventure."
        }
      ]
    },
    {
      "id": "meanfield",
      "title": "Fast and Slow Network",
      "level": 3,
      "parentId": "easy",
      "content": [
        {
          "type": "markdown",
          "data": "### Fast and Slow Network\n\nA small scrollytelling adventure to demonstrate the distinction between annealed and quenched network assumptions. It involved a conceptual understanding of the concepts. The technical challenge was to make a network interactive in the same way than the annealed and quench assumptions. It was done in collaboration with an expert in the field. No data was involved, making the project easier."
        }
      ]
    },
    {
      "id": "medium",
      "title": "Medium Projects",
      "level": 2,
      "parentId": "estimating",
      "content": [
        {
          "type": "markdown",
          "data": "## Medium\n\nMedium projects involve complexity, but has somewhat clear requirements, and a limited sets of dependencies."
        }
      ]
    },
    {
      "id": "quote-tree",
      "title": "Quote Tree",
      "level": 3,
      "parentId": "medium",
      "content": [
        {
          "type": "markdown",
          "data": "### Quote Tree\n\nThe Quote Tree project aimed to build a dashboard whereas the researcher could filter by categories (date, topic, ...), resulting in a tree-like structure of people quoting each other on Twitter. The project involved a fair amount of data wrangling, but the data was already available in a database. It involved on the behalf of the RSE to make use of the Bayesian Estimation Point model to infer political ideology of the users."
        }
      ]
    },
    {
      "id": "hard",
      "title": "Hard Projects",
      "level": 2,
      "parentId": "estimating",
      "content": [
        {
          "type": "markdown",
          "data": "## Hard\n\nHard projects involve significant complexity, unclear requirements, or extensive dependencies."
        }
      ]
    },
    {
      "id": "wikimedia",
      "title": "Wikimedia",
      "level": 3,
      "parentId": "hard",
      "content": [
        {
          "type": "markdown",
          "data": "### Wikimedia\n\nThe Wikimedia project aims to use the wikimedia data and apply tools unique for which Vermont Complex System Institute has an expertise. The client is Wikimedia.\n\nThe precise aims of this project are somewhat fuzzy, but the idea is to help Wikimedia to highlight facts about their data using methods from the institute. It is multifaceted, and part of the project is to design what methods will work best on Wikimedia data, and communicate the results effectively. As such, there are milestones and regular check up on advancements, but there is no clear agreed deliverable at the project onset. It is an ongoing discussion. That said, there are a few steps that were understood to be more or less involved upon accepting the research proposals:\n\n- There is \"backend\" effort involved, as the data is voluminous and require database work to manage effectively.\n- There is also \"frontend\" effort involved, as part of the missions for this project is to highlight results that are unique to both the Wikimedia data and the complex systems approach.\n- In between, there is \"research\" effort involved, as the RSEs are expected to contribute to the design of methods that will shape both the backend and frontend aspects of the work. \n\nAs such, there are multiple dependencies between different parts of the pipeline in this project, making it much harder than specific deliverables."
        }
      ]
    },
    {
      "id": "transportation",
      "title": "Transportation study",
      "level": 3,
      "parentId": "hard",
      "content": [
        {
          "type": "markdown",
          "data": "### Study of Traffic (Advanced)\n\nProject to study traffic in Vermont, ended up including an interactive map showing statistical models. It involved backend and frontend work."
        }
      ]
    }
  ]
}